app/controllers/fichas_controller.rb

  def index
    @fichas = Ficha.all
---
SELECT "fichas".* FROM "fichas"

  def create
    @ficha = Ficha.new(ficha_params)

    respond_to do |format|
      if @ficha.save
---
INSERT INTO "fichas" ("paciente_id", "medico_id", "altura", "imc", "classificacao", "riscos", "circunferencia", "pressao", "glicose", "batimentos", "dieta", "medicamentos", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @ficha.update(ficha_params)
---
UPDATE "fichas" SET "riscos" = ?, "updated_at" = ? WHERE "fichas"."id" = ?  [["riscos", "ppp"], ["updated_at", "2015-04-10 02:33:56.444162"], ["id", 1]]

  def destroy
    @ficha.destroy
---
DELETE FROM "fichas" WHERE "fichas"."id" = ?  [["id", 1]]

    def set_ficha
      @ficha = Ficha.find(params[:id])
---
SELECT  "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", 1]]