app/controllers/pacientes_controller.rb

SELECT "pacientes".* FROM "pacientes"
---
  def index
    @pacientes = Paciente.all

INSERT INTO "pacientes" ("nome", "endereco", "telefone", "email", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @paciente = Paciente.new(paciente_params)

    respond_to do |format|
      if @paciente.save

DELETE FROM "pacientes" WHERE "pacientes"."id" = ?  [["id", 1]]
---
  def destroy
    @paciente.destroy

SELECT  "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_paciente
      @paciente = Paciente.find(params[:id])